; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v7 - type_2 ?v8 - type_1)
 	      (pred_4 ?v6 - object ?v8 - type_1)
	      (pred_2 ?v7 - type_2 ?v1 - type_3)
	      (pred_3 ?v7 - type_2 ?v6 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v7 - type_2 ?v3 ?v4 - type_1)
       :precondition (and  (pred_1 ?v7 ?v3))
       :effect (and  (pred_1 ?v7 ?v4)
		     (not (pred_1 ?v7 ?v3))))

   (:action op_1
       :parameters (?v7 - type_2 ?v2 - object ?v5 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v5) (pred_1 ?v7 ?v5) (pred_2 ?v7 ?v1))
       :effect (and (pred_3 ?v7 ?v2 ?v1)
		    (not (pred_4 ?v2 ?v5)) 
		    (not (pred_2 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_2 ?v2 - object ?v5 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v2 ?v1) (pred_1 ?v7 ?v5))
       :effect (and (pred_4 ?v2 ?v5)
		    (pred_2 ?v7 ?v1)
		    (not (pred_3 ?v7 ?v2 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_2
obj_06 obj_01 - type_3
obj_09 obj_04 obj_05 obj_03 - type_1
obj_02 obj_10 obj_08 - object)
(:init
(pred_1 obj_07 obj_03)
(pred_2 obj_07 obj_06)
(pred_2 obj_07 obj_01)
(pred_4 obj_02 obj_09)
(pred_4 obj_10 obj_09)
(pred_4 obj_08 obj_09)
)
(:goal
(and
(pred_4 obj_02 obj_03)
(pred_4 obj_10 obj_04)
(pred_4 obj_08 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_07 ?b obj_01))))
)
)

; plan
1. (op_2 obj_07 obj_03 obj_09)
   deleted: (pred_1 obj_07 obj_03)
   added: (pred_1 obj_07 obj_09)
   goals met: 1 of 3
2. (op_1 obj_07 obj_02 obj_09 obj_06)
   deleted: (pred_4 obj_02 obj_09) (pred_2 obj_07 obj_06)
   added: (pred_3 obj_07 obj_02 obj_06)
   goals met: 1 of 3
3. (op_2 obj_07 obj_09 obj_03)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_03)
   goals met: 1 of 3
4. (op_3 obj_07 obj_02 obj_03 obj_06)
   deleted: (pred_3 obj_07 obj_02 obj_06)
   added: (pred_4 obj_02 obj_03) (pred_2 obj_07 obj_06)
   goals met: 2 of 3
5. (op_2 obj_07 obj_03 obj_09)
   deleted: (pred_1 obj_07 obj_03)
   added: (pred_1 obj_07 obj_09)
   goals met: 2 of 3
6. (op_1 obj_07 obj_10 obj_09 obj_06)
   deleted: (pred_4 obj_10 obj_09) (pred_2 obj_07 obj_06)
   added: (pred_3 obj_07 obj_10 obj_06)
   goals met: 2 of 3
7. (op_2 obj_07 obj_09 obj_04)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_04)
   goals met: 2 of 3
8. (op_3 obj_07 obj_10 obj_04 obj_06)
   deleted: (pred_3 obj_07 obj_10 obj_06)
   added: (pred_4 obj_10 obj_04) (pred_2 obj_07 obj_06)
   goals met: 3 of 3
